barista/app/controllers/orders_controller.rb

INSERT INTO "orders" ("created_at", "fulfilled", "item", "placed", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save